<?php

/*
|--------------------------------------------------------------------------
| 内网穿透 外网请求服务端 启动配置文件
|--------------------------------------------------------------------------
| 定义内网穿透 外网请求服务端 启动配置
|
*/

return [
    // 是否启用内网穿透服务端
    'enable'    => env('NAT_SERVER_ENABLE', false),
    // 服务端与客户端通信通道服务
    'channel'    => [
        // 监听协议端口
        'listen'    => 'frame://0.0.0.0:' . env('NAT_CHANNEL_PORT', 2209),
        // 进程数，必须是1
        'count'     => 1,
    ],
    // 外网请求服务的配置
    'net'    => [
        // 监听协议端口，需要对外开放，外网访问对应的IP端口即可，tcp协议即支持http、https、tcp三种穿透方式
        'listen'    => 'tcp://0.0.0.0:' . env('NAT_NET_PORT', 8001),
        // 进程数，代理服务端一般单个进程即可
        'count'     => env('NAT_NET_COUNT', 1),
    ]
];
